{
  "packageName": "OwnTracks",
  "author": "Lyle Pakula",
  "minimumHEVersion": "0.0",
  "dateReleased": "2025-08-20",
  "releaseNotes": "v1.8.23 - Fixed migration issue with transition deadband.\nv1.8.23 - Fixed time stamp type conversion in driver.\nv1.8.23 - Removed past cleanup that removed drawer scaling.  Added a deadband to prevent transition and presence  arrived/departed ping-pong notifications.\nv1.8.22 - Added member battery level to each history point.\nv1.8.21 - Google Family Map: Improved zooming on members and member drawer.  Selecting a member row in the drawer selects that member.  Address issue that could lead to thumbnails not being displayed.  Added zoom option for smart displays (Nest, Amazon).\nv1.8.20 - Fixed the zoom issues and removed the mobile portrait mode zoom for the Google Family map.  Fixed race condition when the thumbnails were loading on the family map.  Fixed issue where new users were not being added to the default group.\nv1.8.19 - Added scalers to the map zoom for mobile portrait mode and the member drawer content.\nv1.8.18 - Changed the drawer behavior to allow a single click/tap to open/close vs dragging.  Increased width up to 500 pixels.\nv1.8.17 - Add the ability to scale the thumbnail size Google Family Map member drawer.\nv1.8.15 - Added a member drawer to the bottom of the Google Family Map. Clicking on a thumbnail will follow that user.\nv1.8.14 - Added setting to save the last followed member between map reloads.\nv1.8.13 - Fixed issue where passing a member name to the Google Family Map needed to be in lowercase.\nv1.8.12 - Rephrased the member group reset button.\nv1.8.11 - Fixed issue creating a new region.\nv1.8.10 - Allow all new regions to be added to member notifications if enabled.  Fixed issue where the last notification region/device couldn't be deselected.\nv1.8.9 - Changed app to single threaded.\nv1.8.8 - Fixed location debug logging. Force an update to the transition attributes to eliminate cache delays.\nv1.8.7 - Ignore duplicate transition events if they occur within 5-seconds of the previous one.\nv1.8.7 - Changed map and geocode limits to match upcoming Google changes.\nv1.8.6 - Added radius around the Google Friends Map member pin that scales based on their location accuracy.\nv1.8.5 - Cleanup migration.  Fixed issue if thumbnails were enabled, but no image files were loaded in the hub.\nv1.8.4 - Added missing members element in JSON.\nv1.8.2 - Return last member locations in a JSON message when the mobile app setup URL is requested.  Allow high power mode to be disabled when in a region.\nv1.8.1 - Member status would inaccurately indicate a permission error for iOS phones.\nv1.8.0 - Member status now indicates configurations that will impact location performance.  Fix issue where history compression was not properly removing markers at direction transitions.  Google Friends map will auto-update when the main app updates.\n",
  "documentationLink": "https://github.com/wir3z/hubitat/blob/main/owntracks-hubitat/README.md",
  "communityLink": "https://community.hubitat.com/t/release-owntracks/130821",
  "apps": [
    {
      "id": "9197099c-9560-4983-abdd-b594a8472a75",
      "name": "OwnTracks",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20App.groovy",
      "required": true,
      "oauth": true,
      "primary": true,
      "version": "1.8.23"
    }
  ],
  "drivers": [
    {
      "id": "a6150d8c-a032-4409-9737-0a48eab7ad82",
      "name": "OwnTracks Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Driver.groovy",
      "required": true,
      "version": "1.8.7"
    },
    {
      "id": "acc5f615-8901-4b22-99c3-282a6244b892",
      "name": "OwnTracks Common Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Common%20Driver.groovy",
      "required": true,
      "version": "1.8.1"
    }
  ]
}
