{
  "packageName": "OwnTracks",
  "author": "Lyle Pakula",
  "minimumHEVersion": "0.0",
  "dateReleased": "2023-06-23",
  "releaseNotes": "v1.7.58 - Forced sinceTime attribute to be set to allow consumption by the tile generation.\nv1.7.58 - Moved device sinceTime state variable to a consumable attribute.\nv1.7.58 - When using the dynamic region config map, creating more than one region at a time would result in duplicates.  Testing the map API key with no members would result in an exception and not display the map.\nv1.7.57 - Fixed higher accuracy reporting wasn't happening after the 2.5.x migration changes.  Fixed an error if a user notification was saved, with no selected regions.  Fixed zero battery and zero speed not being debug logged.\nv1.7.56 - Cloud links for Recorder were being displayed when they should not have.\nv1.7.55 - Removed support for the side loaded 2.4.17 forked version.\nv1.7.54 - Prevent the clear waypoints command on 2.4.x.\nv1.7.53 - Fixed issue where transition messages was assigning null to speed. Added additional status command logging and display.\nv1.7.52 - Regions are now deleted from mobile before sending new ones to eliminate duplicate region names.\nv1.7.51 - Added API key validation to the setup screen.  Added Member command API links.\nv1.7.50 - Fixed region migration.  Added integrated virtual switch to device.\nv1.7.49 - Rolled back region migration.  Open app and click done to fix.\nv1.7.48 - Fixed lat/lon rounding when adding a place.  Added support for Android 2.5.x.  Fixed issues with region types that was preventing iOS from updating regions.\nv1.7.47 - Change the member name being passed to the notification handler.\nv1.7.46 - Fixed notifications not working if the device prefix was not blank.\nv1.7.45 - Added per region arrived and departed notification settings.\nv1.7.44 - Fixed blocked notification if a member leaves home but is still connected to wifi.\nv1.7.44 - Changed collapsible sections to retain past state.\nv1.7.43 - Changed cloud/local URL sourcing.  Fixed Google Family map local URL not displaying members.\nv1.7.42 - Refactored layout and section labels to group recommend vs optional configurations.\nv1.7.41 - Detect the incoming phone OS and prevent +follow regions from being sent to Android.\nv1.7.40 - Fixed missing transition name change.\nv1.7.40 - Presence and member tiles get regenerated automatically on change.\nv1.7.39 - Fixed issue with secondary hub link.\nv1.7.38 - Changed driver 'transitionDirection' attribute to 'arrived' and 'departed' from 'enter' and 'leave'.\nv1.7.38 - Fixed presence tile not updating on transitions.\nv1.7.38 - Added radio buttons to Recorder Past Locations tile.  Added directions to use Google maps and geocode in Recorder.\nv1.7.37 - Shuffled menu tabs and text to make the flow more intuitive.\nv1.7.36 - Fixed Google Friends map info box.\nv1.7.35 - Refactored Google Friends map to dynamically update.  Changed map generation.  Fixed updates back to phone which broken in last release.\nv1.7.34 - Fixed dashboard tiles not automatically updating.\nv1.7.33 - Fixed region transfers with secondary hubs.  Added an auto-fresh with the Google Friends map.\nv1.7.32 - Moved region and address selectors directly to the config map.\nv1.7.31 - Fixed exception when no Google Maps API key was entered.\nv1.7.30 - Updated Google family map to have info windows when a user is clicked, and tracking ability.  Added a configuration map when the Google Maps API key is entered.  Fixed exception when no recorder URL is present.\nv1.7.29 - Added an info box when a member is selected in Google maps.  Added ability to change past locations from points to lines.  Fixed secondary hubs not receiving region updates.  Added a send regions to secondary button.\nv1.7.28 - Added start and end search boxes to past locations tile. Added dynamic support for cloud recorder URL.  Hide recorder cloud links when not using https.\nv1.7.27 - Minor changes to screen layout. Created html links for direct member tile access.  Thumbnails are now visible from cloud links.\nv1.7.26 - Changed layout to collapse menu items for cleaner look.  Added Family map using Google Maps API.  Added Google Maps API to region creation to allow for radius' to be viewed. Changed the presence tile layout.\nv1.7.25 - Only add geocode locations to region list if there is no current region list.\nv1.7.24 - Added direct device links to the member table.\nv1.7.23 - Added larger SSID keep distances.\nv1.7.22 - Minor tile cleanup.\nv1.7.22 - Added presence tile for each member.  Changed battery attribute to be a battery percent.  Fixed tile layout margins.\nv1.7.22 - Fixed mobile app location settings pulling from the wrong location when in imperial units.  Allow debug location to be hidden with addresses.\nv1.7.21 - Mobile app location settings failed to switch units to imperial when reset to defaults.\nv1.7.20 - Mobile app location settings failed to switch units to imperial if required.\nv1.7.19 - Updated logging. Removed the request high accuracy location selection box due to it being redundant.\nv1.7.18 - Allow changing the enter/leave notifications.  Added battery capability to driver.\nv1.7.17 - Changed the device name creation to work on all hub versions.  Only create member devices once the user has been enabled.\nv1.7.16 - Add error protection on device prefix change.\nv1.7.15 - Only update the device prefix if one is defined.\nv1.7.14 - Addressed migration issues.\nv1.7.13 - Fixed null exceptions on migration from 1.7.11.\nv1.7.11 - Recorder configuration URL no longer requires the /pub, and will automatically be corrected in the setting.  Added common member driver for friends location tile.  Added last location tile.  Added setting to select WiFi SSID keep radius.Deleted the SSID attribute if the phone switches to mobile data.\nv1.7.10 - Updated the disabled member warning instructions in the logs. Changed the starting zoom level of the region maps to show house level.\nv1.7.9 - Updated OwnTracks Frontend instructions.\nv1.7.8 - Removed dynamic prefix display from settings.\nv1.7.7 - Fixed error preventing app from opening on some hubs.\nv1.7.6 - Allow the device prefix to be changed.\nv1.7.5 - Added Owntracks Frontend instructions.  Removed the Owntracks - prefix from the alternate text on the member tile.  Changed address parsing to separate regions from main address.\nv1.7.4 - Fixed grammar on the transition notifications.  Arrived/Departed buttons update the transitions and send notifications.  Moved to a per member notification scheme.\nv1.7.3 - 'Since' time was not updating properly after refactor.  Block transition if still connected to home WiFi SSID.\nv1.7.2 - Moved the notification selection box to the main screen.  Fix issue where Geoapify geocodes added leading spaces to fields.\nv1.7.1 - Refactored flow to prevent dirty location reports from triggering transitions.  Allow enter/leave transition notifications.\nv1.7.0 - Moved street address logic to app from driver.  Parse out places from address and populate the location attribute.\n",
  "documentationLink": "https://github.com/wir3z/hubitat/blob/main/owntracks-hubitat/README.md",
  "communityLink": "https://community.hubitat.com/t/release-owntracks/130821",
  "apps": [
    {
      "id": "9197099c-9560-4983-abdd-b594a8472a75",
      "name": "OwnTracks",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20App.groovy",
      "required": true,
      "oauth": true,
      "primary": true,
      "version": "1.7.58"
    }
  ],
  "drivers": [
    {
      "id": "a6150d8c-a032-4409-9737-0a48eab7ad82",
      "name": "OwnTracks Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Driver.groovy",
      "required": true,
      "version": "1.7.36"
    },
    {
      "id": "acc5f615-8901-4b22-99c3-282a6244b892",
      "name": "OwnTracks Common Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Common%20Driver.groovy",
      "required": true,
      "version": "1.7.8"
    }
  ]
}