{
  "packageName": "OwnTracks",
  "author": "Lyle Pakula",
  "minimumHEVersion": "0.0",
  "dateReleased": "2023-01-31",
  "releaseNotes":"v1.7.0 - Moved street address logic to app from driver.  Parse out places from address and populate the location attribute.\nv1.6.32 - Fixed issue with lat/lon rounding.  Fixed error with new geocode cache.\nv1.6.31 - Fixed issue where unit conversion could cause error.  Fix issue where member tile would not update as expected.  Fixed issue with member tile with disabled extended attributes.\nv1.6.30 - Typo fix.  Member Tile not displaying in full height.\nv1.6.29 - Fixed issue where SSID was getting stuck holding member at home.\nv1.6.29 - Store the users past address, and re-use that instead of a geocode lookup if their current coordinates are within 10m of that location.\nv1.6.28 - Reduced member tile size to prevent overflow.  Re-factored the attribute updates to allow invalid location packets to update non-location information.\nv1.6.28 - Added 6-decimal place rounding to geocode lat/lon.\nv1.6.27 - Fixed error on first configuration of the geocoder.\nv1.6.26 - Reduced member tile map height to prevent overlapping into the other metrics.\nv1.6.26 - Added SSID to device debug.\nv1.6.26 - Added direct links to the file manager and logs in the setup screens.  Added reverse geocode address support. Create / remove the member tile if the setting is toggled.  Added a 'isImperialUnits' attribute.  Set speed to 0 when it no longer reports.  Created responsive member tile.\nv1.6.25 - Removed setting initialization from driver causing error.\nv1.6.25 - Removed nag warning about home region mismatch.  Removed status attribute from driver.  Added a MemberLocation HTML tile.\nv1.6.24 - Expose the delete button for delete members to reduce confusion.  Changed the driver battery attribute to just display the battery level number.\nv1.6.23 - Add a red information banner to delete old +follow regions if the locater interval changed.  Fixed issue where a home region mismatch would be displayed when a user left home. Expose the ENUM variants for monitoringMode, batteryStatus, dataConnection, and triggerSource.\nv1.6.22 - Location will display an address if provided by the mobile, otherwise lat/lon\nv1.6.22 - Updated the add/edit/delete flow.  Add a banner to the member status table and delete screen for regions pending deletion.\nv1.6.21 - Fixed issue where it was impossible to edit a different region after selecting one.  Added the ability to have private members to not receive member updates or regions.  Added note to edit regions for iOS devices. Added the ability to reset location and display to default.  Home location cleanup.\nv1.6.20 - Fixed a fail to install crash from the +follow maintenance.\nv1.6.19 - Updated the +follow to match the locator priority interval.  Ignore +follow as a reported region.  Added transition and status attributes.\nv1.6.18 - Allow 'Home' to have a name change.  NOTE: breaking change -- 'Home' must be re-selected from the list after upgrading.  Added an automatic +follow region for iOS transition tracking.\nv1.6.16 - Fixed issue where assigning home would get cleared.\nv1.6.15 - Added support for driver to retrieve local file URL.  Fixed issue when home place was deleted.  Provided quick selection to switch locator priority on main screen.\nv1.6.14 - Refactored the layout to make it simpler to install/navigate.  Added the ability to reset the app back to the recommended defaults.  Added ability to request a higher accuracy location on a ping/manual location (Android Only).\nv1.6.13 - Fixed exception with first time configure of the app.  Disabled the 'restart mobile app' due to the OwnTracks Android 2.4.x not starting the ping service after the remote restart.  Added the ability to have the mobile app send a high accuracy location on the next report. Added an auto-request high accuracy location for stale Android locations.\nv1.6.12 - Removed the ability to enable each user to see their own image card on the map due to stability issues.  Added user selectable warning time to mark stale location reports on the Members Status table.  Added location report to the Member status table.  Added ability to check region location on Google Maps.\nv1.6.11- Added a ability to enable each user to see their own image card on the map.  NOTE:  iOS users will see themselves twice.  Added a delete region from Hubitat only setting.  Added how-to information to the respective sections.  Added member status block.\n",
  "documentationLink":"https://github.com/wir3z/hubitat/blob/main/owntracks-hubitat/README.md",
  "communityLink":"https://community.hubitat.com/t/release-owntracks/130821",
  "apps": [
    {
      "id": "9197099c-9560-4983-abdd-b594a8472a75",
      "name": "OwnTracks",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20App.groovy",
      "required": true,
      "oauth": true,
      "primary": true,
      "version": "1.7.0"
    }
  ],
  "drivers": [
    {
      "id": "a6150d8c-a032-4409-9737-0a48eab7ad82",
      "name": "OwnTracks Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Driver.groovy",
      "required": true,
      "version": "1.7.0"
    }
  ]
}
