{
  "packageName": "OwnTracks",
  "author": "Lyle Pakula",
  "minimumHEVersion": "0.0",
  "dateReleased": "2024-12-14",
  "releaseNotes": "v1.8.7 - Ignore duplicate transition events if they occur within 5-seconds of the previous one.\nv1.8.7 - Changed map and geocode limits to match upcoming Google changes.\nv1.8.6 - Added radius around the Google Friends Map member pin that scales based on their location accuracy.\nv1.8.5 - Cleanup migration.  Fixed issue if thumbnails were enabled, but no image files were loaded in the hub.\nv1.8.4 - Added missing members element in JSON.\nv1.8.2 - Return last member locations in a JSON message when the mobile app setup URL is requested.  Allow high power mode to be disabled when in a region.\nv1.8.1 - Member status would inaccurately indicate a permission error for iOS phones.\nv1.8.0 - Member status now indicates configurations that will impact location performance.  Fix issue where history compression was not properly removing markers at direction transitions.  Google Friends map will auto-update when the main app updates.\nv1.7.94 - Recreates missing member devices should they be deleted from the Hubitat device menu and not the app.\nv1.7.93 -  Members were not getting sorted based on last location time.  Fixed Google maps member order to display the last reported member and member in focus on top.\nv1.7.92 - Added inline Google maps documentation. When a member info box was open on Google maps, it wouldn't automatically refresh.  Add more descriptive app permission warnings to the info box. Adjust member location iframe to hide the view on larger map overlay.\nv1.7.91 - Added member friend groups.\nv1.7.90 - Added member deactivation to clear the mobile URL and waypoints.  Prevent location updates over 5-minutes old from triggering member presence.\nv1.7.89 - Refactored zoom and history selection to Google maps.  Added a user configurable distance for the auto-zoom in Google maps.  Added stale member notifications.\nv1.7.88 - Fixed exception if a member was deleted and past settings were not cleared.\nv1.7.87 - Fixed exception in trip numbering when member has no history.\nv1.7.86 - Selecting trips when all member trips are visible will bring it into focus.\nv1.7.85 - Selecting a trip will bring it into focus.\nv1.7.84 - Re-worked the zoom/auto zoom controls.  Set the minimum history speed limit to <2KPH to reduce noisy location points.  Prevent calculating speed on rapidly arriving locations.\nv1.7.83 - Disable auto zoom/centering when the map is panned or a history point is opened and member is being tracked.\nv1.7.82 - Improved trip stats display.  Give full trip stats when a trip line is selected.  Disable auto zoom/centering when the map is panned or a history point is opened.\nv1.7.81 - Added trip stats to history points.\nv1.7.80 - Added trip odometer.\nv1.7.79 - Reduced saved address to street address only.  Added trip markers to history.  Don't save locations with repeated 0 speed or similar bearing.  Fixed speed calculations if phone returned 0 speed.\nv1.7.78 - Bearing calculation was inverted.\nv1.7.77 - Calculates bearing if returned bearing was 0.  Dynamically change the speed icon on Google Map based on speed.\nv1.7.76 - Fixed exception on new install without previous history.  Calculates speed if returned speed was 0.  Added directional bearing to Google Map.\nv1.7.75 - Fixed exception on new install without previous history.\nv1.7.74 - Fixed course over ground, added member bearing.  Fixed exception on new install without previous history.\nv1.7.73 - Fixed exception with long history if the app was not opened after the updated.\nv1.7.72 - Added increased past history stored at a slower recording interval.  Added slider to disable cloud web links.\nv1.7.71 - Added scaling to history lines and directional arrows.\nv1.7.70 - Added connecting lines to history with directional arrows.  Fixed history point zoom.\n",
  "documentationLink": "https://github.com/wir3z/hubitat/blob/main/owntracks-hubitat/README.md",
  "communityLink": "https://community.hubitat.com/t/release-owntracks/130821",
  "apps": [
    {
      "id": "9197099c-9560-4983-abdd-b594a8472a75",
      "name": "OwnTracks",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20App.groovy",
      "required": true,
      "oauth": true,
      "primary": true,
      "version": "1.8.7"
    }
  ],
  "drivers": [
    {
      "id": "a6150d8c-a032-4409-9737-0a48eab7ad82",
      "name": "OwnTracks Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Driver.groovy",
      "required": true,
      "version": "1.8.0"
    },
    {
      "id": "acc5f615-8901-4b22-99c3-282a6244b892",
      "name": "OwnTracks Common Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Common%20Driver.groovy",
      "required": true,
      "version": "1.8.0"
    }
  ]
}
