{
  "packageName": "OwnTracks",
  "author": "Lyle Pakula",
  "minimumHEVersion": "0.0",
  "dateReleased": "2023-02-21",
  "releaseNotes": "v1.7.24 - Added direct device links to the member table.\nv1.7.23 - Added larger SSID keep distances.\nv1.7.22 - Minor tile cleanup.\nv1.7.22 - Added presence tile for each member.  Changed battery attribute to be a battery percent.  Fixed tile layout margins.\nv1.7.22 - Fixed mobile app location settings pulling from the wrong location when in imperial units.  Allow debug location to be hidden with addresses.\nv1.7.21 - Mobile app location settings failed to switch units to imperial when reset to defaults.\nv1.7.20 - Mobile app location settings failed to switch units to imperial if required.\nv1.7.19 - Updated logging. Removed the request high accuracy location selection box due to it being redundant.\nv1.7.18 - Allow changing the enter/leave notifications.  Added battery capability to driver.\nv1.7.17 - Changed the device name creation to work on all hub versions.  Only create member devices once the user has been enabled.\nv1.7.16 - Add error protection on device prefix change.\nv1.7.15 - Only update the device prefix if one is defined.\nv1.7.14 - Addressed migration issues.\nv1.7.13 - Fixed null exceptions on migration from 1.7.11.\nv1.7.11 - Recorder configuration URL no longer requires the /pub, and will automatically be corrected in the setting.  Added common member driver for friends location tile.  Added last location tile.  Added setting to select WiFi SSID keep radius.Deleted the SSID attribute if the phone switches to mobile data.\nv1.7.10 - Updated the disabled member warning instructions in the logs. Changed the starting zoom level of the region maps to show house level.\nv1.7.9 - Updated OwnTracks Frontend instructions.\nv1.7.8 - Removed dynamic prefix display from settings.\nv1.7.7 - Fixed error preventing app from opening on some hubs.\nv1.7.6 - Allow the device prefix to be changed.\nv1.7.5 - Added Owntracks Frontend instructions.  Removed the Owntracks - prefix from the alternate text on the member tile.  Changed address parsing to separate regions from main address.\nv1.7.4 - Fixed grammar on the transition notifications.  Arrived/Departed buttons update the transitions and send notifications.  Moved to a per member notification scheme.\nv1.7.3 - 'Since' time was not updating properly after refactor.  Block transition if still connected to home WiFi SSID.\nv1.7.2 - Moved the notification selection box to the main screen.  Fix issue where Geoapify geocodes added leading spaces to fields.\nv1.7.1 - Refactored flow to prevent dirty location reports from triggering transitions.  Allow enter/leave transition notifications.\nv1.7.0 - Moved street address logic to app from driver.  Parse out places from address and populate the location attribute.\nv1.6.32 - Fixed issue with lat/lon rounding.  Fixed error with new geocode cache.\nv1.6.31 - Fixed issue where unit conversion could cause error.  Fix issue where member tile would not update as expected.  Fixed issue with member tile with disabled extended attributes.\nv1.6.30 - Typo fix.  Member Tile not displaying in full height.\nv1.6.29 - Fixed issue where SSID was getting stuck holding member at home.\nv1.6.29 - Store the users past address, and re-use that instead of a geocode lookup if their current coordinates are within 10m of that location.\nv1.6.28 - Reduced member tile size to prevent overflow.  Re-factored the attribute updates to allow invalid location packets to update non-location information.\nv1.6.28 - Added 6-decimal place rounding to geocode lat/lon.\nv1.6.27 - Fixed error on first configuration of the geocoder.\nv1.6.26 - Reduced member tile map height to prevent overlapping into the other metrics.\nv1.6.26 - Added SSID to device debug.\nv1.6.26 - Added direct links to the file manager and logs in the setup screens.  Added reverse geocode address support. Create / remove the member tile if the setting is toggled.  Added a 'isImperialUnits' attribute.  Set speed to 0 when it no longer reports.  Created responsive member tile.\nv1.6.25 - Removed setting initialization from driver causing error.\nv1.6.25 - Removed nag warning about home region mismatch.  Removed status attribute from driver.  Added a MemberLocation HTML tile.\nv1.6.24 - Expose the delete button for delete members to reduce confusion.  Changed the driver battery attribute to just display the battery level number.\nv1.6.23 - Add a red information banner to delete old +follow regions if the locater interval changed.  Fixed issue where a home region mismatch would be displayed when a user left home. Expose the ENUM variants for monitoringMode, batteryStatus, dataConnection, and triggerSource.\nv1.6.22 - Location will display an address if provided by the mobile, otherwise lat/lon\nv1.6.22 - Updated the add/edit/delete flow.  Add a banner to the member status table and delete screen for regions pending deletion.\nv1.6.21 - Fixed issue where it was impossible to edit a different region after selecting one.  Added the ability to have private members to not receive member updates or regions.  Added note to edit regions for iOS devices. Added the ability to reset location and display to default.  Home location cleanup.\nv1.6.20 - Fixed a fail to install crash from the +follow maintenance.\nv1.6.19 - Updated the +follow to match the locator priority interval.  Ignore +follow as a reported region.  Added transition and status attributes.\nv1.6.18 - Allow 'Home' to have a name change.  NOTE: breaking change -- 'Home' must be re-selected from the list after upgrading.  Added an automatic +follow region for iOS transition tracking.\nv1.6.16 - Fixed issue where assigning home would get cleared.\n",
  "documentationLink": "https://github.com/wir3z/hubitat/blob/main/owntracks-hubitat/README.md",
  "communityLink": "https://community.hubitat.com/t/release-owntracks/130821",
  "apps": [
    {
      "id": "9197099c-9560-4983-abdd-b594a8472a75",
      "name": "OwnTracks",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20App.groovy",
      "required": true,
      "oauth": true,
      "primary": true,
      "version": "1.7.24"
    }
  ],
  "drivers": [
    {
      "id": "a6150d8c-a032-4409-9737-0a48eab7ad82",
      "name": "OwnTracks Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Driver.groovy",
      "required": true,
      "version": "1.7.13"
    },
    {
      "id": "acc5f615-8901-4b22-99c3-282a6244b892",
      "name": "OwnTracks Common Driver",
      "namespace": "lpakula",
      "location": "https://raw.githubusercontent.com/wir3z/hubitat/main/owntracks-hubitat/OwnTracks%20Common%20Driver.groovy",
      "required": true,
      "version": "1.7.2"
    }
  ]
}